Repository: leka/ios-monorepo
Catalog: Modules/ContentKit/Resources/Localizable.xcstrings
Source language: en
Languages: fr

# content_kit.activity_details_view.activity_label
source: Activity
fr: Activité

# content_kit.activity_details_view.authors_section_title
source: Authors
fr: Auteurs

# content_kit.activity_details_view.skills_section_title
source: Skills
fr: Compétences

# content_kit.activity_details_view.start_activity_button_label
source: Start activity
fr: Démarrer l’activité

# content_kit.activity_list_view.play_button_label
source: Play
fr: Jouer

# content_kit.curriculum_details_view.activities_section_title
source: Activities
fr: Activités

# content_kit.curriculum_details_view.authors_section_title
source: Authors
fr: Auteurs

# content_kit.curriculum_details_view.curriculum_label
source: Curriculum
fr: Parcours

# content_kit.curriculum_details_view.see_less_label
source: See less
fr: Voir moins

# content_kit.curriculum_details_view.see_more_label
source: See more
fr: Voir plus

# content_kit.curriculum_details_view.skills_section_title
source: Skills
fr: Compétences

# content_kit.curriculum_groupbox_view.activity_count_label
source: %d activities
fr: %d activités

# content_kit.curriculum_groupbox_view.curriculum_label
source: Curriculum
fr: Parcours

# content_kit.library_activity_list_view.play_button_label
source: Play
fr: Jouer

# content_kit.sample_story_list_view.start_story_button_label
source: Start story
fr: Démarrer l'histoire

# content_kit.search_grid_view.activities_title
source: Activities
fr: Activités

# content_kit.search_grid_view.curriculums_title
source: Curriculums
fr: Parcours

# content_kit.search_grid_view.no_results
source: Oops! No results found.
fr: Désolé ! Aucun résultat trouvé.

# content_kit.search_grid_view.see_all_label
source: See all
fr: Voir tout

# content_kit.search_grid_view.skills_title
source: Skills
fr: Compétences

# content_kit.skills_grid_view.activity_count_label
source: %d activities
fr: %d activités

# content_kit.story_details_view.authors_section_title
source: Authors
fr: Auteurs

# content_kit.story_details_view.skills_section_title
source: Skills
fr: Compétences

# content_kit.story_list_view.play_button_label
source: Play
fr: Jouer

# game_engine_kit.action_button_observe.button_label
source: Tap to reveal
fr: Touche pour révéler

# game_engine_kit.action_button_observe.image_unknown_error
source: ❌ Image not found: %1$@
fr: ❌ Image non reconnue : %1$@

# game_engine_kit.action_button_view.observe_button.image_unknown_error
source: ❌ Image not found: %1$@
fr: ❌ Image non reconnue : %1$@

# game_engine_kit.activity_view.continue_button
source: Continue
fr: Continuer

# game_engine_kit.activity_view.finish_button
source: Finish
fr: Terminer

# game_engine_kit.activity_view.hide_reinforcer_to_show_answers_button
source: Review answers
fr: Revoir les réponses

# game_engine_kit.activity_view.quit_activity_alert.cancel_button_label
source: Cancel
fr: Annuler

# game_engine_kit.activity_view.quit_activity_alert.message
source: Are you sure you want to quit this activity?
fr: Êtes-vous sûr de vouloir quitter cette activité ?

# game_engine_kit.activity_view.quit_activity_alert.quit_button_label
source: Quit
fr: Quitter

# game_engine_kit.activity_view.quit_activity_alert.title
source: Leave activity?
fr: Quitter l'activité ?

# game_engine_kit.activity_view.toolbar.dismiss_button
source: Dismiss
fr: Annuler

# game_engine_kit.choice_emoji_view.emoji_error
source: ❌ Text is not emoji: %1$@
fr: ❌ Ce texte n'est pas un émoji: %1$@

# game_engine_kit.choice_image_view.image_unknown_error
source: ❌ Image not found: %1$@
fr: ❌ Image non reconnue: %1$@

# game_engine_kit.choice_sf_symbol_view.sf_symbol_unknown_error
source: ❌ SF Symbol not found: %1$@
fr: ❌ Symbole non reconnu: %1$@

# game_engine_kit.color_mediator_view.choose_colors_button_label
source: Choose colors
fr: Choisir les couleurs

# game_engine_kit.color_mediator_view.color_selector.close_label
source: Close
fr: Fermer

# game_engine_kit.color_mediator_view.color_selector.instruction
source: Select colors you want to play with
fr: Choisir les couleurs

# game_engine_kit.color_mediator_view.color_selector.select_label
source: Select
fr: Sélectionner

# game_engine_kit.color_mediator_view.next_button_label
source: Next color
fr: Prochaine couleur

# game_engine_kit.color_mediator_view.play_button_label
source: Start coloring Leka
fr: Démarrer

# game_engine_kit.color_mediator_view.robot_color
source: Robot color
fr: Couleur du robot

# game_engine_kit.color_mediator_view.shuffle_color_label
source: Shuffle
fr: Aléatoire

# game_engine_kit.color_mediator_view.stop_button_label
source: Stop coloring Leka
fr: Arrêt

# game_engine_kit.dance_freeze_view.auto_button_label
source: Play - Auto mode
fr: Jouer - Mode auto

# game_engine_kit.dance_freeze_view.instructions
source: Dance with Leka to the music and act like a statue when he stops
fr: Danse avec Leka au rythme de la musique et fais la statue lorsque elle s'arrête

# game_engine_kit.dance_freeze_view.manual_button_label
source: Play - Manual mode
fr: Jouer - Mode manuel

# game_engine_kit.dance_freeze_view.motion_selection_title
source: Motion type
fr: Type de mouvement

# game_engine_kit.dance_freeze_view.movement_button_label
source: Movement
fr: Déplacement

# game_engine_kit.dance_freeze_view.music_selection_title
source: Music selection
fr: Sélection de la musique

# game_engine_kit.discover_leka_view.play_button_label
source: Play
fr: Jouer

# game_engine_kit.discover_leka_view.player.instructions
source: "Discover Leka" allows the accompanied person to become familiar with Leka before even entering into learning Activities and Curriculums. The robot will come to life, taking pauses so that the care receiver can tame your new companion!
fr: "Découvre Leka" permet à la personne accompagnée de se familiariser à Leka avant même d'entrer dans les apprentissages des Activités et des Parcours. Le robot va s'animer en faisant des pauses afin que la personne accompagnée puisse apprivoiser son nouveau compagnon !

# game_engine_kit.exercise_view.validate_button_label
source: Validate
fr: Valider

# game_engine_kit.exercise_view.validate_correct_answer_button_label
source: Validate Correct Answer
fr: Valider la bonne réponse

# game_engine_kit.hide_and_seek_view.launcher.instructions
source: Press OK when Leka is hidden
fr: Appuie sur OK lorsque Leka est caché

# game_engine_kit.hide_and_seek_view.player.found_button_label
source: Found!
fr: Trouvé !

# game_engine_kit.hide_and_seek_view.player.instructions
source: Encourage the care receiver to seek Leka. You can throw a reinforcer to give him a visual and/or audible clue. Press FOUND! once the robot found.
fr: Incite la personne accompagnée à chercher Leka. Tu peux lancer un renforçateur pour lui donner un indice visuel et/ou sonore. Appuie sur "TROUVÉ" une fois le robot trouvé.

# game_engine_kit.led_zone_selector_view.front_label
source: Front
fr: Avant

# game_engine_kit.magic_card_view.instructions
source: Bring the magic card to the robot's forehead to validate the answer.
fr: Apporter la carte magique sur le front du robot pour valider la réponse.

# game_engine_kit.melody_view.keyboard_full
source: Full keyboard
fr: Clavier entier

# game_engine_kit.melody_view.keyboard_partial
source: Partial keyboard
fr: Clavier partiel

# game_engine_kit.melody_view.keyboard_selector_title
source: Keyboard type
fr: Type de clavier

# game_engine_kit.melody_view.play_button_label
source: Play
fr: Jouer

# game_engine_kit.melody_view.skip_button_label
source: Skip
fr: Passer

# game_engine_kit.melody_view.song_selector_title
source: Music selection
fr: Sélection de la musique

# game_engine_kit.memory_choice_view.type_unknown_error
source: ❌ ERROR Choice type not implemented
fr: ❌ ERREUR Type non implémenté

# game_engine_kit.robot_then_touch_to_select.button_label
source: Tap Leka
fr: Touche Leka

# game_engine_kit.story_view.finish_button_label
source: Finish
fr: Terminer

# game_engine_kit.story_view.quit_story_alert.cancel_button_label
source: Cancel
fr: Annuler

# game_engine_kit.story_view.quit_story_alert.message
source: Are you sure you want to quit this activity?
fr: Êtes-vous sûr de vouloir quitter cette activité ?

# game_engine_kit.story_view.quit_story_alert.quit_button_label
source: Quit
fr: Quitter

# game_engine_kit.story_view.quit_story_alert.title
source: Leave story?
fr: Quitter l'histoire ?

# game_engine_kit.success_failure_view.failure_cheering_label
source: Try again!
fr: Essaies encore !

# game_engine_kit.success_failure_view.quit_button_label
source: Quit
fr: Quitter

# game_engine_kit.success_failure_view.success_cheering_label
source: Well done, you've succeeded this activity!
fr: Bien joué, tu as réussi l'activité !

# game_engine_kit.success_failure_view.success_percentage_label
source: %.0f%% of success!
fr: %.0f%% de succès !

# game_engine_kit.super_simon.button_label
source: Tap Leka
fr: Touche Leka

# game_engine_kit.super_simon.type_unknown_error
source: ❌ ERROR Interface not implemented
fr: ❌ ERREUR Interface non implémentée

# game_engine_kit.super_simon_choice_view.type_unknown_error
source: ❌ ERROR Choice type not implemented
fr: ❌ ERREUR Type non implémenté

# game_engine_kit.touch_to_select_choice_view.type_unknown_error
source: ❌ ERROR Choice type not implemented
fr: ❌ ERREUR Type non implémenté

# library.menu_actions.add_to_library_button_label
source: Add to Library
fr: Ajouter à la Bibliothèque

# library.menu_actions.favorite_button_label
source: Favorite
fr: Ajouter aux Favoris

# library.menu_actions.remove_from_library_button_label
source: Remove from Library
fr: Retirer de la Bibliothèque

# library.menu_actions.undo_favorite_button_label
source: Undo Favorite
fr: Retirer des Favoris

# library.table.title_column_label
source: Title
fr: Titre
